In [1]:
import pandas as pd

In [2]:
dataframe = pd.read_csv(r'D:/pandas/dataframe.csv')

In [3]:
dataframe

  Nombre y Apellido  Edad       Pais Automovil   Peso
0              Juan    35     Mexico        No  d�lar
1             Pedro    41   Honduras        Si   peso
2             Maria    28       Peru        Si   peso
3             Laura    66  Argentina        No   peso

In [5]:
dataframe.iloc[3]#visualizamos por indice

Nombre y Apellido        Laura
Edad                        66
Pais                 Argentina
Automovil                   No
Peso                      peso
Name: 3, dtype: object

In [10]:
dataframe.iloc[[3,2,1]]#visualizamos por indice seleccionado

  Nombre y Apellido  Edad       Pais Automovil  Peso
3             Laura    66  Argentina        No  peso
2             Maria    28       Peru        Si  peso
1             Pedro    41   Honduras        Si  peso

In [12]:
dataframe.iloc[1:3]#visualizamos desde un numero a otro

  Nombre y Apellido  Edad      Pais Automovil  Peso
1             Pedro    41  Honduras        Si  peso
2             Maria    28      Peru        Si  peso